app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `address`, `created_at`, `updated_at`) VALUES ('', '', '--- !ruby/hash:ActionController::Parameters\nstreet: \'\'\ncity: asdasd\n', '2016-07-26 09:12:32', '2016-07-26 09:12:32')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `name` = 'Test', `email` = 'test@user.com', `address` = '--- !ruby/hash:ActionController::Parameters\nstreet: Street\ncity: asdasd\n', `updated_at` = '2016-07-26 09:13:08' WHERE `users`.`id` = 2